INSERT INTO airlines (airline_name, airline_code) VALUES 
('SU', 'Аэрофлот'),
('S7', 'S7 Airlines'),
('U6', 'Уральские Авиалинии'),
('UT', 'ЮТэйр'),
('N4', 'Северный Ветер (Nordwind)'),
('5N', 'SmartAvia'),
('A4', 'Азимут'),
('R3', 'Якутия'),
('IK', 'Ираэро'),
('KL', 'Россия'),
('D9', 'Победа'),
('WZ', 'Red Wings'),
('R2', 'РусЛайн'),
('L2', 'Авиакомпания «ИрАэро»'),
('H9', 'Хортица'),
('N6', 'Нордавиа'),
('Y7', 'Саратовские авиалинии'),
('A3', 'Авиакомпания «Трансаэро»'),
('D8', 'Дальавиа'),
('F7', 'Авиакомпания «Томск Авиа»'),
('Q3', 'Кубань-авиа');

INSERT INTO airports (id, display_airport_name, airport_code, airport_city, airport_fullname, airport_state, airport_country, latitude, longitude)
VALUES
(1, 'Шереметьево', 'SVO', 'Москва', 'Международный аэропорт Шереметьево', 'МО', 'Россия', 55.9726, 37.4146),
(2, 'Домодедово', 'DME', 'Москва', 'Международный аэропорт Домодедово', 'МО', 'Россия', 55.4103, 37.9026),
(3, 'Внуково', 'VKO', 'Москва', 'Международный аэропорт Внуково', 'МО', 'Россия', 55.5983, 37.2615),
(4, 'Пулково', 'LED', 'Санкт-Петербург', 'Международный аэропорт Пулково', 'ЛО', 'Россия', 59.8003, 30.2625),
(5, 'Сочи', 'AER', 'Сочи', 'Международный аэропорт Сочи', 'КК', 'Россия', 43.4499, 39.9566),
(6, 'Казань', 'KZN', 'Казань', 'Международный аэропорт Казань', 'РТ', 'Россия', 55.6063, 49.2787),
(7, 'Толмачево', 'OVB', 'Новосибирск', 'Международный аэропорт Толмачево', 'НСО', 'Россия', 55.0126, 82.6507),
(8, 'Кольцово', 'SVX', 'Екатеринбург', 'Международный аэропорт Кольцово', 'СО', 'Россия', 56.7431, 60.8027),
(9, 'Платов', 'ROV', 'Ростов-на-Дону', 'Международный аэропорт Платов', 'РО', 'Россия', 47.4939, 39.9244),
(10, 'Пашковский', 'KRR', 'Краснодар', 'Международный аэропорт Пашковский', 'КК', 'Россия', 45.0346, 39.1705),
(11, 'Уфа', 'UFA', 'Уфа', 'Международный аэропорт Уфа', 'РБ', 'Россия', 54.5575, 55.8742),
(12, 'Храброво', 'KGD', 'Калининград', 'Международный аэропорт Храброво', 'КО', 'Россия', 54.8898, 20.5927),
(13, 'Минеральные Воды', 'MRV', 'Минеральные Воды', 'Международный аэропорт Минеральные Воды', 'СК', 'Россия', 44.2251, 43.0819),
(14, 'Иркутск', 'IKT', 'Иркутск', 'Международный аэропорт Иркутск', 'ИО', 'Россия', 52.2669, 104.3887),
(15, 'Гумрак', 'VOG', 'Волгоград', 'Международный аэропорт Гумрак', 'ВО', 'Россия', 48.7824, 44.3455),
(16, 'Новый', 'KHV', 'Хабаровск', 'Международный аэропорт Хабаровск-Новый', 'ХК', 'Россия', 48.5282, 135.1889),
(17, 'Владивосток', 'VVO', 'Владивосток', 'Международный аэропорт Владивосток', 'ПК', 'Россия', 43.3979, 132.1479),
(18, 'Сургут', 'SGC', 'Сургут', 'Международный аэропорт Сургут', 'ХМАО', 'Россия', 61.3428, 73.4018),
(19, 'Стригино', 'GOJ', 'Нижний Новгород', 'Международный аэропорт Стригино', 'НО', 'Россия', 56.2301, 43.7871),
(20, 'Баландино', 'CEK', 'Челябинск', 'Международный аэропорт Баландино', 'ЧО', 'Россия', 55.3052, 61.5054),
(21, 'Магнитогорск', 'MMK', 'Магнитогорск', 'Международный аэропорт Магнитогорск', 'ЧО', 'Россия', 53.3914, 58.7603),
(22, 'Барнаул', 'BAX', 'Барнаул', 'Международный аэропорт имени Г.С. Титова', 'АК', 'Россия', 53.3639, 83.5386),
(23, 'Елизово', 'PKC', 'Петропавловск-Камчатский', 'Международный аэропорт Петропавловск-Камчатский', 'КК', 'Россия', 53.1664, 158.4535),
(24, 'Рощино', 'TJM', 'Тюмень', 'Международный аэропорт Рощино', 'ТО', 'Россия', 57.1896, 65.3243),
(25, 'Витязево', 'AAQ', 'Анапа', 'Международный аэропорт Анапа-Витязево', 'КК', 'Россия', 44.9000, 37.3167),
(26, 'Талаги', 'ARH', 'Архангельск', 'Международный аэропорт Архангельск', 'АО', 'Россия', 64.6000, 40.7167),
(27, 'Нариманово', 'ASF', 'Астрахань', 'Международный аэропорт Астрахань', 'АО', 'Россия', 46.2833, 48.0063),
(28, 'Сыктывкар', 'SCW', 'Сыктывкар', 'Международный аэропорт Сыктывкар', 'РК', 'Россия', 61.6700, 50.8452),
(29, 'Большое Савино', 'PEE', 'Пермь', 'Международный аэропорт Пермь', 'ПК', 'Россия', 57.9167, 56.0211),
(30, 'Уйташ', 'MCX', 'Махачкала', 'Международный аэропорт Махачкала', 'РД', 'Россия', 42.8167, 47.6523),
(31, 'Якутск', 'YKS', 'Якутск', 'Международный аэропорт Якутск', 'РС(Я)', 'Россия', 62.0933, 129.7717),
(32, 'Центральный', 'OMS', 'Омск', 'Международный аэропорт Омск-Центральный', 'ОО', 'Россия', 54.9667, 73.3167),
(33, 'Сокол', 'GDX', 'Магадан', 'Международный аэропорт Магадан-Сокол', 'МО', 'Россия', 59.9100, 150.7200),
(34, 'Шпаковское', 'STW', 'Ставрополь', 'Международный аэропорт Ставрополь', 'СК', 'Россия', 45.1092, 42.1128),
(35, 'Центральный', 'REN', 'Оренбург', 'Международный аэропорт Оренбург', 'ОО', 'Россия', 51.5833, 46.0667),
(36, 'Богашёво', 'TOF', 'Томск', 'Международный аэропорт Томск', 'ТО', 'Россия', 56.5000, 84.9667),
(37, 'Центральный', 'RTW', 'Саратов', 'Международный аэропорт Гагарин', 'СО', 'Россия', 51.5667, 46.0667),
(38, 'Емельяново', 'KJA', 'Красноярск', 'Международный аэропорт Красноярск', 'КК', 'Россия', 56.1728, 92.4933),
(39, 'Игнатьево', 'BQS', 'Благовещенск', 'Международный аэропорт Благовещенск', 'АО', 'Россия', 50.4258, 127.4103),
(40, 'Байкал', 'UUD', 'Улан-Удэ', 'Международный аэропорт Байкал', 'РБ', 'Россия', 51.8067, 107.4383),
(41, 'Угольный', 'DYR', 'Анадырь', 'Международный аэропорт Анадырь', 'ЧАО', 'Россия', 64.7350, 177.7417),
(42, 'Ноябрьск', 'NOJ', 'Ноябрьск', 'Аэропорт Ноябрьск', 'ЯНАО', 'Россия', 63.1833, 75.2700),
(43, 'Новый Уренгой', 'NUX', 'Новый Уренгой', 'Международный аэропорт Новый Уренгой', 'ЯНАО', 'Россия', 65.9500, 78.3667),
(44, 'Чебоксары', 'CSY', 'Чебоксары', 'Международный аэропорт Чебоксары', 'ЧР', 'Россия', 56.1500, 43.0667),
(45, 'Терновка', 'PEZ', 'Пенза', 'Международный аэропорт Пенза', 'ПО', 'Россия', 53.1167, 45.0167),
(46, 'Баратаевка', 'ULV', 'Ульяновск', 'Международный аэропорт Ульяновск-Баратаевка', 'УО', 'Россия', 54.2683, 48.2267),
(47, 'Ижевск', 'IJK', 'Ижевск', 'Международный аэропорт Ижевск', 'УР', 'Россия', 56.8300, 53.4500),
(48, 'Надым', 'NYM', 'Надым', 'Аэропорт Надым', 'ЯНАО', 'Россия', 65.4811, 72.6989),
(49, 'Кневичи', 'UCT', 'Уссурийск', 'Аэропорт Кневичи', 'ПК', 'Россия', 43.3883, 132.1533),
(50, 'Сыктывкар', 'SCW', 'Сыктывкар', 'Международный аэропорт Сыктывкар', 'РК', 'Россия', 61.6700, 50.8452),
(51, 'Кызыл', 'KYZ', 'Кызыл', 'Аэропорт Кызыл', 'РТ', 'Россия', 51.6694, 94.4006),
(52, 'Кемерово', 'KEJ', 'Кемерово', 'Международный аэропорт имени А.А. Леонова', 'КО', 'Россия', 55.2700, 86.1072),
(53, 'Грозный', 'GRV', 'Грозный', 'Международный аэропорт Грозный', 'ЧР', 'Россия', 43.3221, 45.0254),
(54, 'Нальчик', 'NAL', 'Нальчик', 'Международный аэропорт Нальчик', 'КБР', 'Россия', 43.5129, 43.6366),
(55, 'Магас', 'MQF', 'Магас', 'Аэропорт Магас', 'РИ', 'Россия', 43.8224, 44.6083),
(56, 'Воркута', 'VLK', 'Воркута', 'Аэропорт Воркута', 'РК', 'Россия', 67.4886, 63.9931),
(57, 'Усинск', 'USK', 'Усинск', 'Аэропорт Усинск', 'РК', 'Россия', 65.4456, 52.4336),
(58, 'Усть-Кут', 'UKX', 'Усть-Кут', 'Аэропорт Усть-Кут', 'ИО', 'Россия', 56.8560, 105.7303),
(59, 'Хатанга', 'HTG', 'Хатанга', 'Аэропорт Хатанга', 'КК', 'Россия', 71.9781, 102.4911),
(60, 'Норильск', 'NSK', 'Норильск', 'Аэропорт Норильск', 'КК', 'Россия', 69.3111, 87.3322),
(61, 'Игнатьево', 'IGT', 'Майкоп', 'Аэропорт Майкоп', 'РА', 'Россия', 43.4389, 41.9308),
(62, 'Элиста', 'ESL', 'Элиста', 'Аэропорт Элиста', 'РК', 'Россия', 46.3734, 44.3314),
(63, 'Салехард', 'SLY', 'Салехард', 'Аэропорт Салехард', 'ЯНАО', 'Россия', 66.5972, 66.6110),
(64, 'Тында', 'TYD', 'Тында', 'Аэропорт Тында', 'АО', 'Россия', 55.2783, 124.7353),
(65, 'Певек', 'CYX', 'Певек', 'Аэропорт Певек', 'ЧАО', 'Россия', 68.7406, 161.3378),
(66, 'Чокурдах', 'CNN', 'Чокурдах', 'Аэропорт Чокурдах', 'РС(Я)', 'Россия', 67.4691, 136.6494),
(67, 'Ленск', 'ULK', 'Ленск', 'Аэропорт Ленск', 'РС(Я)', 'Россия', 60.7200, 114.8250),
(68, 'Мирный', 'MJZ', 'Мирный', 'Аэропорт Мирный', 'РС(Я)', 'Россия', 62.5347, 114.0395),
(69, 'Черский', 'CKH', 'Черский', 'Аэропорт Черский', 'РС(Я)', 'Россия', 70.6231, 147.9019),
(70, 'Комсомольск-на-Амуре', 'KXK', 'Комсомольск-на-Амуре', 'Аэропорт Хурба', 'ХК', 'Россия', 50.4094, 136.9342),
(71, 'Магдагачи', 'GDG', 'Магдагачи', 'Аэропорт Магдагачи', 'АО', 'Россия', 51.5167, 103.5667),
(72, 'Удачный', 'DEE', 'Удачный', 'Аэропорт Удачный', 'РС(Я)', 'Россия', 68.6953, 112.8017),
(73, 'Кемь', 'KEM', 'Кемь', 'Аэропорт Кемь', 'РК', 'Россия', 64.9500, 34.5833),
(74, 'Котлас', 'KSZ', 'Котлас', 'Аэропорт Котлас', 'АО', 'Россия', 61.2357, 46.6971),
(75, 'Нефтеюганск', 'NFG', 'Нефтеюганск', 'Аэропорт Нефтеюганск', 'ХМАО', 'Россия', 61.1083, 72.6500),
(76, 'Охотск', 'OHO', 'Охотск', 'Аэропорт Охотск', 'ХК', 'Россия', 59.4100, 143.0667),
(77, 'Рыбинск', 'RYB', 'Рыбинск', 'Аэропорт Староселье', 'ЯО', 'Россия', 58.1042, 38.9294),
(78, 'Курск', 'URS', 'Курск', 'Аэропорт Курск-Восточный', 'КО', 'Россия', 51.7500, 36.2958),
(79, 'Великий Устюг', 'VUS', 'Великий Устюг', 'Аэропорт Великий Устюг', 'ВО', 'Россия', 60.7833, 46.3000),
(80, 'Вологда', 'VGD', 'Вологда', 'Аэропорт Вологда', 'ВО', 'Россия', 59.2833, 39.9500),
(81, 'Орск', 'OSW', 'Орск', 'Аэропорт Орск', 'ОО', 'Россия', 54.2333, 36.6000),
(82, 'Печора', 'PEX', 'Печора', 'Аэропорт Печора', 'РК', 'Россия', 65.1167, 57.1333),
(83, 'Белоярский', 'EYK', 'Белоярский', 'Аэропорт Белоярский', 'ХМАО', 'Россия', 63.6833, 66.6833),
(84, 'Брянск', 'BZK', 'Брянск', 'Аэропорт Брянск', 'БО', 'Россия', 53.2141, 34.1764),
(85, 'Стрежевой', 'SWT', 'Стрежевой', 'Аэропорт Стрежевой', 'ТО', 'Россия', 60.7667, 77.6667),
(86, 'Ульяновск-Восточный', 'ULY', 'Ульяновск', 'Аэропорт Ульяновск-Восточный', 'УО', 'Россия', 54.4000, 48.8000),
(87, 'Чита', 'HTA', 'Чита', 'Аэропорт Кадала', 'ЗК', 'Россия', 52.0267, 113.3050),
(88, 'Игарка', 'IAA', 'Игарка', 'Аэропорт Игарка', 'КК', 'Россия', 67.4372, 86.6217),
(89, 'Киров', 'KVX', 'Киров', 'Аэропорт Победилово', 'КО', 'Россия', 58.5033, 49.3483),
(90, 'Йошкар-Ола', 'JOK', 'Йошкар-Ола', 'Аэропорт Йошкар-Ола', 'РМЭ', 'Россия', 56.4833, 44.0500),
(91, 'Калуга', 'KLF', 'Калуга', 'Международный аэропорт Калуга', 'КО', 'Россия', 54.5333, 36.3667),
(92, 'Тамбов', 'TBW', 'Тамбов', 'Аэропорт Тамбов-Донское', 'ТО', 'Россия', 52.8067, 41.4825),
(93, 'Талакан', 'TLK', 'Талакан', 'Аэропорт Талакан', 'РС(Я)', 'Россия', 59.8764, 111.0444),
(94, 'Игрим', 'IRM', 'Игрим', 'Аэропорт Игрим', 'ХМАО', 'Россия', 63.1833, 64.4403),
(95, 'Советский', 'OVS', 'Советский', 'Аэропорт Советский', 'ХМАО', 'Россия', 61.3267, 63.6017),
(96, 'Урай', 'URJ', 'Урай', 'Аэропорт Урай', 'ХМАО', 'Россия', 60.1167, 64.8333),
(97, 'Туринск', 'UEN', 'Туринск', 'Аэропорт Туринск', 'СО', 'Россия', 56.9333, 62.7000),
(98, 'Южно-Сахалинск', 'EKS', 'Южно-Сахалинск', 'Аэропорт Хомутово', 'СО', 'Россия', 49.2100, 142.7000),
(99, 'Дальнегорск', 'DHG', 'Дальнегорск', 'Аэропорт Дальнегорск', 'ПК', 'Россия', 44.5583, 135.0139),
(100, 'Южно-Курильск', 'GVN', 'Южно-Курильск', 'Аэропорт Менделеево', 'СО', 'Россия', 45.3167, 147.6833),
(101, 'Оха', 'OHH', 'Оха', 'Аэропорт Оха', 'СО', 'Россия', 53.5167, 142.1667),
(102, 'Комсомольск-на-Амуре', 'KBL', 'Комсомольск-на-Амуре', 'Аэропорт Комсомольск-на-Амуре', 'ХК', 'Россия', 48.4167, 135.1667),
(103, 'Геленджик', 'GDZ', 'Геленджик', 'Аэропорт Геленджик', 'КК', 'Россия', 44.5825, 38.0158),
(104, 'Белая Гора', 'BCX', 'Белая Гора', 'Аэропорт Белая Гора', 'РС(Я)', 'Россия', 43.2983, 132.1522),
(105, 'Тикси', 'TII', 'Тикси', 'Аэропорт Тикси', 'РС(Я)', 'Россия', 71.6981, 128.9031),
(106, 'Чокурдах', 'CKL', 'Чокурдах', 'Аэропорт Чокурдах', 'РС(Я)', 'Россия', 70.2833, 163.9833),
(107, 'Зырянка', 'ZKP', 'Зырянка', 'Аэропорт Зырянка', 'РС(Я)', 'Россия', 65.7167, 150.7000),
(108, 'Сунтар', 'SUY', 'Сунтар', 'Аэропорт Сунтар', 'РС(Я)', 'Россия', 62.1833, 117.6333),
(109, 'Усть-Куйга', 'UKG', 'Усть-Куйга', 'Аэропорт Усть-Куйга', 'РС(Я)', 'Россия', 70.0108, 135.6456),
(110, 'Верхневилюйск', 'VRI', 'Верхневилюйск', 'Аэропорт Верхневилюйск', 'РС(Я)', 'Россия', 67.5481, 133.3900),
(111, 'Среднеколымск', 'SEK', 'Среднеколымск', 'Аэропорт Среднеколымск', 'РС(Я)', 'Россия', 67.4703, 153.7364);

-- DELETE FROM flights;
select *
from flight_data_for_visualization
limit 1;
-- DELETE FROM delay;
-- DELETE FROM flight_airport_2;


-- новая таблица для сбора данных для визуализации
CREATE TABLE flight_data_for_visualization AS
SELECT
    f.fl_date AS "FlightDate",
    EXTRACT(YEAR FROM f.fl_date) AS "Year",
    EXTRACT(MONTH FROM f.fl_date) AS "Month",
    EXTRACT(DAY FROM f.fl_date) AS "DayofMonth",
    EXTRACT(DOW FROM f.fl_date) + 1 AS "DayOfWeek", -- PostgreSQL DOW: 0 (Sunday) to 6 (Saturday)
    f.airline_code AS "Reporting_Airline",
    a.airline_name AS "Airline_Name",
    f.origin_airport AS "Origin",
    org.airport_city AS "OriginCityName",
    org.airport_state AS "OriginState",
    f.dest_airport AS "Dest",
    dst.airport_city AS "DestCityName",
    dst.airport_state AS "DestState",
    f.distance AS "Distance",
    f.dep_time AS "CRSDepTime",
    f.arr_time AS "CRSArrTime",
    f.air_time AS "AirTime",
    p.tail_num AS "Tail_Number",
    p.plane_type AS "Aircraft_Type",
    p.number_of_seats AS "Seats",
    d.dep_delay AS "DepDelay",
    d.arr_delay AS "ArrDelay",
    CASE
        WHEN d.dep_delay > 0 THEN
            CASE
                WHEN d.dep_delay >= 15 AND d.dep_delay < 60 THEN 'Small Delay'
                WHEN d.dep_delay >= 60 AND d.dep_delay < 180 THEN 'Medium Delay'
                WHEN d.dep_delay >= 180 THEN 'Large Delay'
                ELSE 'No Delay'
            END
        ELSE 'No Delay'
    END AS "DelayCategory",
    d.cancelled AS "Cancelled",
    d.cancellation_code AS "CancellationCode",
    CASE
        WHEN d.cancellation_code = 'A' THEN (d.dep_delay + COALESCE(d.arr_delay, 0))
        ELSE 0
    END AS "CarrierDelay",
    CASE
        WHEN d.cancellation_code = 'B' THEN (d.dep_delay + COALESCE(d.arr_delay, 0))
        ELSE 0
    END AS "WeatherDelay",
    CASE
        WHEN d.cancellation_code = 'C' THEN (d.dep_delay + COALESCE(d.arr_delay, 0))
        ELSE 0
    END AS "NASDelay",
    CASE
        WHEN d.cancellation_code = 'D' THEN (d.dep_delay + COALESCE(d.arr_delay, 0))
        ELSE 0
    END AS "SecurityDelay",
    CASE
        WHEN d.cancellation_code IS NULL OR d.cancellation_code = '' THEN
            (d.dep_delay + COALESCE(d.arr_delay, 0))
        ELSE 0
    END AS "LateAircraftDelay",
    0 AS "TaxiIn", -- Предполагаемые значения, так как нет в вашей БД
    0 AS "TaxiOut", -- Предполагаемые значения, так как нет в вашей БД
    f.air_time AS "ActualElapsedTime",
    f.air_time AS "CRSElapsedTime" -- Предполагаем что запланированное время = фактическому
FROM
    public.flights f
LEFT JOIN
    public.delay d ON f.id = d.id
LEFT JOIN
    public.airlines a ON f.airline_code = a.airline_code
LEFT JOIN
    public.planes p ON f.tail_num = p.tail_num
LEFT JOIN
    public.airports org ON f.origin_airport = org.airport_code
LEFT JOIN
    public.airports dst ON f.dest_airport = dst.airport_code
ORDER BY
    f.fl_date;


SELECT *
FROM public.flight_data_for_visualization
ORDER BY md5(random()::text)
LIMIT 100;